Python 3.8.7 (v3.8.7:6503f05dd5, Dec 21 2020, 12:45:15) 
[Clang 6.0 (clang-600.0.57)] on darwin
Type "help", "copyright", "credits" or "license()" for more information.
>>> 
================ RESTART: /Users/macbookpro/dev/python/pizza.py ================
Сколько пицц Вы хотите? 2
Сколкьо стоит пицца в меню? 150
Полная стоимость заказа $ 324.0
в том числе налог$ 24.0
За пиццу отдельно $ 300
>>> 
========================================================================== RESTART: /Users/macbookpro/Documents/save_my_name.py ==========================================================================
как тебя зовут?ИГОРЬ
ИГОРЬИГОРЬИГОРЬИГОРЬИГОРЬИГОРЬИГОРЬИГОРЬИГОРЬИГОРЬИГОРЬИГОРЬИГОРЬИГОРЬИГОРЬИГОРЬИГОРЬИГОРЬИГОРЬИГОРЬИГОРЬИГОРЬИГОРЬИГОРЬИГОРЬИГОРЬИГОРЬИГОРЬИГОРЬИГОРЬИГОРЬИГОРЬИГОРЬИГОРЬИГОРЬИГОРЬИГОРЬИГОРЬИГОРЬИГОРЬИГОРЬИГОРЬИГОРЬИГОРЬИГОРЬИГОРЬИГОРЬИГОРЬИГОРЬИГОРЬИГОРЬИГОРЬИГОРЬИГОРЬИГОРЬИГОРЬИГОРЬИГОРЬИГОРЬИГОРЬИГОРЬИГОРЬИГОРЬИГОРЬИГОРЬИГОРЬИГОРЬИГОРЬИГОРЬИГОРЬИГОРЬИГОРЬИГОРЬИГОРЬИГОРЬИГОРЬИГОРЬИГОРЬИГОРЬИГОРЬИГОРЬИГОРЬИГОРЬИГОРЬИГОРЬИГОРЬИГОРЬИГОРЬИГОРЬИГОРЬИГОРЬИГОРЬИГОРЬИГОРЬИГОРЬИГОРЬИГОРЬИГОРЬИГОРЬИГОРЬ
>>> 
============= RESTART: /Users/macbookpro/Documents/save_my_name.py =============
как тебя зовут?оля
олямолодецолямолодецолямолодецолямолодецолямолодецолямолодецолямолодецолямолодецолямолодецолямолодецолямолодецолямолодецолямолодецолямолодецолямолодецолямолодецолямолодецолямолодецолямолодецолямолодецолямолодецолямолодецолямолодецолямолодецолямолодецолямолодецолямолодецолямолодецолямолодецолямолодецолямолодецолямолодецолямолодецолямолодецолямолодецолямолодецолямолодецолямолодецолямолодецолямолодецолямолодецолямолодецолямолодецолямолодецолямолодецолямолодецолямолодецолямолодецолямолодецолямолодецолямолодецолямолодецолямолодецолямолодецолямолодецолямолодецолямолодецолямолодецолямолодецолямолодецолямолодецолямолодецолямолодецолямолодецолямолодецолямолодецолямолодецолямолодецолямолодецолямолодецолямолодецолямолодецолямолодецолямолодецолямолодецолямолодецолямолодецолямолодецолямолодецолямолодецолямолодецолямолодецолямолодецолямолодецолямолодецолямолодецолямолодецолямолодецолямолодецолямолодецолямолодецолямолодецолямолодецолямолодецолямолодецолямолодецолямолодецолямолодецолямолодецолямолодец
>>> 
============= RESTART: /Users/macbookpro/Documents/save_my_name.py =============
как тебя зовут?Олечка
Олечкамолодец! Олечкамолодец! Олечкамолодец! Олечкамолодец! Олечкамолодец! Олечкамолодец! Олечкамолодец! Олечкамолодец! Олечкамолодец! Олечкамолодец! Олечкамолодец! Олечкамолодец! Олечкамолодец! Олечкамолодец! Олечкамолодец! Олечкамолодец! Олечкамолодец! Олечкамолодец! Олечкамолодец! Олечкамолодец! Олечкамолодец! Олечкамолодец! Олечкамолодец! Олечкамолодец! Олечкамолодец! Олечкамолодец! Олечкамолодец! Олечкамолодец! Олечкамолодец! Олечкамолодец! Олечкамолодец! Олечкамолодец! Олечкамолодец! Олечкамолодец! Олечкамолодец! Олечкамолодец! Олечкамолодец! Олечкамолодец! Олечкамолодец! Олечкамолодец! Олечкамолодец! Олечкамолодец! Олечкамолодец! Олечкамолодец! Олечкамолодец! Олечкамолодец! Олечкамолодец! Олечкамолодец! Олечкамолодец! Олечкамолодец! Олечкамолодец! Олечкамолодец! Олечкамолодец! Олечкамолодец! Олечкамолодец! Олечкамолодец! Олечкамолодец! Олечкамолодец! Олечкамолодец! Олечкамолодец! Олечкамолодец! Олечкамолодец! Олечкамолодец! Олечкамолодец! Олечкамолодец! Олечкамолодец! Олечкамолодец! Олечкамолодец! Олечкамолодец! Олечкамолодец! Олечкамолодец! Олечкамолодец! Олечкамолодец! Олечкамолодец! Олечкамолодец! Олечкамолодец! Олечкамолодец! Олечкамолодец! Олечкамолодец! Олечкамолодец! Олечкамолодец! Олечкамолодец! Олечкамолодец! Олечкамолодец! Олечкамолодец! Олечкамолодец! Олечкамолодец! Олечкамолодец! Олечкамолодец! Олечкамолодец! Олечкамолодец! Олечкамолодец! Олечкамолодец! Олечкамолодец! Олечкамолодец! Олечкамолодец! Олечкамолодец! Олечкамолодец! Олечкамолодец! Олечкамолодец! 
>>> 
============= RESTART: /Users/macbookpro/Documents/save_my_name.py =============
как тебя зовут?Олечка
Олечка молодец! Олечка молодец! Олечка молодец! Олечка молодец! Олечка молодец! Олечка молодец! Олечка молодец! Олечка молодец! Олечка молодец! Олечка молодец! Олечка молодец! Олечка молодец! Олечка молодец! Олечка молодец! Олечка молодец! Олечка молодец! Олечка молодец! Олечка молодец! Олечка молодец! Олечка молодец! Олечка молодец! Олечка молодец! Олечка молодец! Олечка молодец! Олечка молодец! Олечка молодец! Олечка молодец! Олечка молодец! Олечка молодец! Олечка молодец! Олечка молодец! Олечка молодец! Олечка молодец! Олечка молодец! Олечка молодец! Олечка молодец! Олечка молодец! Олечка молодец! Олечка молодец! Олечка молодец! Олечка молодец! Олечка молодец! Олечка молодец! Олечка молодец! Олечка молодец! Олечка молодец! Олечка молодец! Олечка молодец! Олечка молодец! Олечка молодец! Олечка молодец! Олечка молодец! Олечка молодец! Олечка молодец! Олечка молодец! Олечка молодец! Олечка молодец! Олечка молодец! Олечка молодец! Олечка молодец! Олечка молодец! Олечка молодец! Олечка молодец! Олечка молодец! Олечка молодец! Олечка молодец! Олечка молодец! Олечка молодец! Олечка молодец! Олечка молодец! Олечка молодец! Олечка молодец! Олечка молодец! Олечка молодец! Олечка молодец! Олечка молодец! Олечка молодец! Олечка молодец! Олечка молодец! Олечка молодец! Олечка молодец! Олечка молодец! Олечка молодец! Олечка молодец! Олечка молодец! Олечка молодец! Олечка молодец! Олечка молодец! Олечка молодец! Олечка молодец! Олечка молодец! Олечка молодец! Олечка молодец! Олечка молодец! Олечка молодец! Олечка молодец! Олечка молодец! Олечка молодец! Олечка молодец! Олечка молодец! 
>>> 
============= RESTART: /Users/macbookpro/Documents/save_my_name.py =============
как тебя зовут?Олечка
Олечка я тебя хочу! Олечка я тебя хочу! Олечка я тебя хочу! Олечка я тебя хочу! Олечка я тебя хочу! Олечка я тебя хочу! Олечка я тебя хочу! Олечка я тебя хочу! Олечка я тебя хочу! Олечка я тебя хочу! Олечка я тебя хочу! Олечка я тебя хочу! Олечка я тебя хочу! Олечка я тебя хочу! Олечка я тебя хочу! Олечка я тебя хочу! Олечка я тебя хочу! Олечка я тебя хочу! Олечка я тебя хочу! Олечка я тебя хочу! Олечка я тебя хочу! Олечка я тебя хочу! Олечка я тебя хочу! Олечка я тебя хочу! Олечка я тебя хочу! Олечка я тебя хочу! Олечка я тебя хочу! Олечка я тебя хочу! Олечка я тебя хочу! Олечка я тебя хочу! Олечка я тебя хочу! Олечка я тебя хочу! Олечка я тебя хочу! Олечка я тебя хочу! Олечка я тебя хочу! Олечка я тебя хочу! Олечка я тебя хочу! Олечка я тебя хочу! Олечка я тебя хочу! Олечка я тебя хочу! Олечка я тебя хочу! Олечка я тебя хочу! Олечка я тебя хочу! Олечка я тебя хочу! Олечка я тебя хочу! Олечка я тебя хочу! Олечка я тебя хочу! Олечка я тебя хочу! Олечка я тебя хочу! Олечка я тебя хочу! Олечка я тебя хочу! Олечка я тебя хочу! Олечка я тебя хочу! Олечка я тебя хочу! Олечка я тебя хочу! Олечка я тебя хочу! Олечка я тебя хочу! Олечка я тебя хочу! Олечка я тебя хочу! Олечка я тебя хочу! Олечка я тебя хочу! Олечка я тебя хочу! Олечка я тебя хочу! Олечка я тебя хочу! Олечка я тебя хочу! Олечка я тебя хочу! Олечка я тебя хочу! Олечка я тебя хочу! Олечка я тебя хочу! Олечка я тебя хочу! Олечка я тебя хочу! Олечка я тебя хочу! Олечка я тебя хочу! Олечка я тебя хочу! Олечка я тебя хочу! Олечка я тебя хочу! Олечка я тебя хочу! Олечка я тебя хочу! Олечка я тебя хочу! Олечка я тебя хочу! Олечка я тебя хочу! Олечка я тебя хочу! Олечка я тебя хочу! Олечка я тебя хочу! Олечка я тебя хочу! Олечка я тебя хочу! Олечка я тебя хочу! Олечка я тебя хочу! Олечка я тебя хочу! Олечка я тебя хочу! Олечка я тебя хочу! Олечка я тебя хочу! Олечка я тебя хочу! Олечка я тебя хочу! Олечка я тебя хочу! Олечка я тебя хочу! Олечка я тебя хочу! Олечка я тебя хочу! Олечка я тебя хочу! Олечка я тебя хочу! 
>>> reset()
Traceback (most recent call last):
  File "<pyshell#0>", line 1, in <module>
    reset()
NameError: name 'reset' is not defined
>>> 
================= RESTART: /Users/macbookpro/Downloads/first.py ================
2
введите число 34
Ваше число больше загаданного
введите число 34
Ваше число больше загаданного
введите число 12
Ваше число больше загаданного
введите число 2
Вы победили
>>> 
================= RESTART: /Users/macbookpro/Downloads/first.py ================
21
введите число 
================= RESTART: /Users/macbookpro/Downloads/first.py ================
введите число 56
Ваше число меньше загаданного
введите число 78
Ваше число меньше загаданного
введите число 89
Ваше число больше загаданного
введите число 84
Ваше число меньше загаданного
введите число 85
Ваше число меньше загаданного
введите число 86
Ваше число меньше загаданного
введите число 87
Ваше число меньше загаданного
введите число 88
Вы победили
>>> 
================= RESTART: /Users/macbookpro/Downloads/first.py ================
введите число от 1 до 100
================= RESTART: /Users/macbookpro/Downloads/first.py ================
введите число от 1 до 100: 81
Ваше число больше загаданного
введите число 20
Ваше число больше загаданного
введите число 16
Ваше число больше загаданного
введите число 1
Ваше число меньше загаданного
введите число 15
Ваше число больше загаданного
введите число 12
Вы победили
>>> 
================= RESTART: /Users/macbookpro/Downloads/first.py ================
введите число от 1 до 100: 43
Ваше число меньше загаданного
введите число 55
Ваше число меньше загаданного
введите число 66
Ваше число меньше загаданного
введите число 77
Ваше число меньше загаданного
введите число 88
Ваше число меньше загаданного
введите число 99
Ваше число больше загаданного
введите число 90
Ваше число меньше загаданного
введите число 
Traceback (most recent call last):
  File "/Users/macbookpro/Downloads/first.py", line 32, in <module>
    chislo = int( input('введите число '))
ValueError: invalid literal for int() with base 10: ''
>>> 
================= RESTART: /Users/macbookpro/Downloads/first.py ================
введите число от 1 до 100: 4
Ваше число меньше загаданного
введите число 10
Ваше число меньше загаданного
введите число 20
Ваше число меньше загаданного
введите число 50
Ваше число меньше загаданного
введите число 100
Ваше число больше загаданного
введите число 59
Ваше число меньше загаданного
введите число 60
Ваше число меньше загаданного
введите число 70
Ваше число меньше загаданного
введите число 80
Ваше число меньше загаданного
введите число 90
Ваше число больше загаданного
введите число 85
Ваше число меньше загаданного
введите число 86
Ваше число меньше загаданного
введите число 87
Ваше число меньше загаданного
введите число 88
Вы победили
>>> 
================= RESTART: /Users/macbookpro/Downloads/first.py ================
введите число от 1 до 100: 10
Ваше число меньше загаданного
введите число 126
Ваше число больше загаданного
введите число 52
Ваше число меньше загаданного
введите число 578
Ваше число больше загаданного
введите число 67
Ваше число меньше загаданного
введите число 70
Ваше число больше загаданного
введите число 69
Ваше число больше загаданного
введите число 68
Вы победили
>>> 
================= RESTART: /Users/macbookpro/Downloads/first.py ================
введите число от 1 до 100: 
Traceback (most recent call last):
  File "/Users/macbookpro/Downloads/first.py", line 18, in <module>
    chislo = int( input('введите число от 1 до 100: '))
ValueError: invalid literal for int() with base 10: ''
>>> 
================= RESTART: /Users/macbookpro/Downloads/first.py ================
введите число от 1 до 100: 65
Ваше число больше загаданного
введите число 
================= RESTART: /Users/macbookpro/Downloads/first.py ================
введите число от 1 до 100: 
Traceback (most recent call last):
  File "/Users/macbookpro/Downloads/first.py", line 18, in <module>
    chislo = int( input('введите число от 1 до 100: '))
ValueError: invalid literal for int() with base 10: ''
>>> 
================= RESTART: /Users/macbookpro/Downloads/first.py ================
введите число от 1 до 100: 
Traceback (most recent call last):
  File "/Users/macbookpro/Downloads/first.py", line 18, in <module>
    chislo = int( input('введите число от 1 до 100: '))
ValueError: invalid literal for int() with base 10: ''
>>> 
================= RESTART: /Users/macbookpro/Downloads/first.py ================
введите число от 1 до 100: 
Traceback (most recent call last):
  File "/Users/macbookpro/Downloads/first.py", line 18, in <module>
    chislo = int( input('введите число от 1 до 100: '))
ValueError: invalid literal for int() with base 10: ''
>>> 
================= RESTART: /Users/macbookpro/Downloads/first.py ================
введите число от 1 до 100: 
Traceback (most recent call last):
  File "/Users/macbookpro/Downloads/first.py", line 18, in <module>
    chislo = int( input('введите число от 1 до 100: '))
ValueError: invalid literal for int() with base 10: ''
>>> 
================= RESTART: /Users/macbookpro/Downloads/first.py ================
введите число от 1 до 100: 120
Ваше число больше загаданного
Ваше число больше диапазона
введите число 
================= RESTART: /Users/macbookpro/Downloads/first.py ================
введите число от 1 до 100: 
Traceback (most recent call last):
  File "/Users/macbookpro/Downloads/first.py", line 18, in <module>
    chislo = int( input('введите число от 1 до 100: '))
ValueError: invalid literal for int() with base 10: ''
>>> 
================= RESTART: /Users/macbookpro/Downloads/first.py ================
введите число от 1 до 100: 
Traceback (most recent call last):
  File "/Users/macbookpro/Downloads/first.py", line 18, in <module>
    chislo = int( input('введите число от 1 до 100: '))
ValueError: invalid literal for int() with base 10: ''
>>> 
================= RESTART: /Users/macbookpro/Downloads/first.py ================
введите число от 1 до 100: 
Traceback (most recent call last):
  File "/Users/macbookpro/Downloads/first.py", line 18, in <module>
    chislo = int( input('введите число от 1 до 100: '))
ValueError: invalid literal for int() with base 10: ''
>>> 
================= RESTART: /Users/macbookpro/Downloads/first.py ================
введите число от 1 до 100: о
Traceback (most recent call last):
  File "/Users/macbookpro/Downloads/first.py", line 18, in <module>
    chislo = int( input('введите число от 1 до 100: '))
ValueError: invalid literal for int() with base 10: 'о'
>>> 
================= RESTART: /Users/macbookpro/Downloads/first.py ================
введите число от 1 до 100: 38
Ваше число меньше загаданного
введите число 45678
Ваше число больше загаданного
Ваше число больше диапазона
Ваше число меньше загаданного
введите число 
================= RESTART: /Users/macbookpro/Downloads/first.py ================
введите число от 1 до 100: 890056
Ваше число больше загаданного
Ваше число больше диапазона
Ваше число меньше загаданного
введите число 100
Ваше число больше загаданного
Ваше число меньше загаданного
введите число 34
Ваше число меньше загаданного
введите число 200
Ваше число больше загаданного
Ваше число больше диапазона
Ваше число меньше загаданного
введите число 900
Ваше число больше загаданного
Ваше число больше диапазона
Ваше число меньше загаданного
введите число 900
Ваше число больше загаданного
Ваше число больше диапазона
Ваше число меньше загаданного
введите число 88
Ваше число меньше загаданного
введите число 96
Ваше число больше загаданного
Ваше число меньше загаданного
введите число 
================= RESTART: /Users/macbookpro/Downloads/first.py ================
79
введите число 88
Ваше число больше загаданного
введите число 12
Ваше число меньше загаданного
введите число 06
Ваше число меньше загаданного
введите число 098876545321
Ваше число больше загаданного
введите число 567
Ваше число больше загаданного
введите число `14
Traceback (most recent call last):
  File "/Users/macbookpro/Downloads/first.py", line 30, in <module>
    chislo = int( input('введите число '))
ValueError: invalid literal for int() with base 10: '`14'
>>> 
================= RESTART: /Users/macbookpro/Downloads/first.py ================
62
введите число `14
Traceback (most recent call last):
  File "/Users/macbookpro/Downloads/first.py", line 18, in <module>
    chislo = int( input('введите число '))
ValueError: invalid literal for int() with base 10: '`14'
>>> `14
SyntaxError: invalid syntax
>>> 899999
899999
>>> 
================= RESTART: /Users/macbookpro/Downloads/first.py ================
58
введите число 78
Ваше число больше загаданного
введите число 123
Ваше число больше загаданного
введите число 23
Ваше число меньше загаданного
введите число 65
Ваше число больше загаданного
введите число 56
Ваше число меньше загаданного
введите число 123088
Ваше число больше загаданного
введите число 1234
Ваше число больше загаданного
введите число   8854
Ваше число больше загаданного
введите число 345
Ваше число больше загаданного
введите число 1
Ваше число меньше загаданного
введите число 0
Ваше число меньше загаданного
введите число 674
Ваше число больше загаданного
введите число 
Traceback (most recent call last):
  File "/Users/macbookpro/Downloads/first.py", line 30, in <module>
    chislo = int( input('введите число '))
ValueError: invalid literal for int() with base 10: ''


>>> 
>>> 
>>> 
>>> 
>>> 
>>> 67
67
>>> 
================= RESTART: /Users/macbookpro/Downloads/first.py ================
11
введите число 